# Cm Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Cm Property
SymbolTypeId Class See Also
---
Symbol cm, indicating unit Centimeters.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Cm { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Cm As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Cm {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace